In [26]:
import pandas as pd

In [27]:
df = pd.read_excel('BOARD 10 AWARD LIST CLASS X 2022-23.xlsx', sheet_name='XB3')
df.head()

   S.NO.  ADM. NO.      STUDENT NAME MARKS Unnamed: 4
0      1      2476     Aashna Parmar  49.5          A
1      2      2540  Aditya Choudhary    ab          A
2      3      2684     Aditya Manhas    49          A
3      4      2579      Aditya Singh  49.5          A
4      5      3808      Aditya Singh  48.5          A

In [28]:
name_list = df['STUDENT NAME'].tolist()
print(len(name_list))

40

In [44]:
capitalized_name_list = [name.upper() for name in name_list]

In [45]:
exam = pd.read_excel('log_book.xlsx')
exam = exam.reset_index(drop=True)
exam.head()

,S.No.,Roll No.,Student Name,Gender,PAINTING,Unnamed: 5,COMM. SANSKRIT,Unnamed: 7,FRENCH,Unnamed: 9,...,Unnamed: 19,INFO TECHNOLOGY(O),Unnamed: 21,MATHEMATICS,Unnamed: 23,Total Marks,Over All %,Best Five Total Marks,Best Five Marks %,Result
0,1,21191208,ARYAN TIWARI,Male,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,99,A1,90.0,A2,520,0.8667,443,0.886,PASS
1,2,21191209,AYUSH SHARMA,Male,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,97,A1,67.0,B2,444,0.7400,379,0.758,PASS
2,3,21191206,ANSHUMAN SIROHI,Male,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,68,D1,47.0,C2,342,0.5700,299,0.598,PASS
3,4,21191207,ARYAN PARASHAR,Male,NaN,NaN,NaN,NaN,NaN,NaN,...,B2,97,A1,NaN,NaN,470,0.7833,419,0.838,PASS
4,5,21191212,CHAITALI CHAUDHARY,Female,NaN,NaN,NaN,NaN,NaN,NaN,...,B1,97,A1,NaN,NaN,462,0.7700,406,0.812,PASS

In [46]:
columns = exam.columns.tolist()
print(columns)

['S.No.', 'Roll No.', 'Student Name', 'Gender', 'PAINTING', 'Unnamed: 5', 'COMM. SANSKRIT', 'Unnamed: 7', 'FRENCH', 'Unnamed: 9', 'HINDI COURSE-B', 'Unnamed: 11', 'SCIENCE-THEORY', 'Unnamed: 13', 'SOCIAL SCIENCE', 'Unnamed: 15', 'ENGLISH LNG & LIT.', 'Unnamed: 17', 'MATHEMATICS -BASIC', 'Unnamed: 19', 'INFO TECHNOLOGY(O)', 'Unnamed: 21', 'MATHEMATICS', 'Unnamed: 23', 'Total Marks', 'Over All %', 'Best Five Total Marks', 'Best Five Marks %', 'Result']

In [47]:
final = exam.loc[:, ['Student Name', 'SOCIAL SCIENCE']]
sorted_df = final.sort_values(by=['Student Name'])
sorted_df.head()

         Student Name  SOCIAL SCIENCE
109       AARAV VERMA              77
148  AARNAVI TRIPATHI              86
32      AASHNA PARMAR              94
69   AAYUSH CHOWDHARY              64
146   ABHIMANYU BISHT              98

In [53]:
print(len(sorted_df))

189
(189, 29)

In [48]:
mask = sorted_df['Student Name'].isin(capitalized_name_list)
filtered_df = final.loc[mask, :]
filtered_df.head()

(189,)

        Student Name  SOCIAL SCIENCE
32     AASHNA PARMAR              94
33  ADITYA CHOUDHARY              88
36      ADITYA SINGH              95
38     ADITYA MANHAS              78
39      ADITYA SINGH              97

In [49]:
print(len(filtered_df))

34

In [51]:
filtered_df.to_excel('filtered_data_b3.xlsx', index=False)

In [54]:
print(len(sorted_df))
sorted_df.to_excel('sorted_data.xlsx', index=False)

189